$(document).ready(function() {
    // date-range-picker
    $('input[name=date-range-picker]').daterangepicker({
        applyClass: 'btn-sm btn-success',
        cancelClass: 'btn-sm btn-default',
        locale: {
            applyLabel: '确认',
            cancelLabel: '取消',
            fromLabel: '起始',
            toLabel: '结束',
            customRangeLabel: 'Custom',
            daysOfWeek: ['日', '一', '二', '三', '四', '五', '六'],
            monthNames: ['一月', '二月', '三月', '四月', '五月', '六月', '七月', '八月', '九月', '十月', '十一月', '十二月'],
            firstDay: 1
        }
    }).prev().on(ace.click_event, function() {
        $(this).next().focus();
    });

    // dataTable initialization
    $('#cell-alarm-table').dataTable({
        lengthMenu: [ [5, 10, 20, 30, 50, -1], [5, 10, 20, 30, 50, "所有"] ],
        ordering: false,
        paging: true,
        info: true,
        filter: true,
        language: {
            lengthMenu: "显示 _MENU_ 项结果",
            zeroRecords: "没有匹配结果",
            info: "显示第 _START_ 至 _END_ 项结果，共 _TOTAL_ 项",
            infoEmpty: "显示第 0 至 0 项结果，共 0 项",
            infoFiltered: "(由 _MAX_ 项结果过滤)",
            search: "搜索：",
            paginate: {
                previous: "上页",
                next: "下页",
                first: "首页",
                last: "末页"
            }
        }
    });

    // update cell-history-morris-chart when change selected option
    $("#cell-history-chart-form").submit(function(event) {
        event.preventDefault();
        var chartType = $("#cell-chart-type option:selected").val();
        switch (chartType) {
            case "0":
                graph.setData(voltageData);
                break;
            case "1":
                graph.setData(currentData);
                break;
            case "2":
                graph.setData(resistanceData);
                break;
            case "3":
                graph.setData(capacityData);
                break;
            case "4":
                graph.setData(dischargeData);
                break;
            case "5":
                graph.setData(tempData);
                graph.
                break;
        }
    });

    // first initialization with single-voltage-data
    var graph = new Morris.Line({
        element: 'cell-history-morris-chart',
        data: [
            { x: '2015-04-01', y: 2.23 },
            { x: '2015-04-02', y: 2.24 },
            { x: '2015-04-03', y: 2.25 },
            { x: '2015-04-04', y: 2.26 },
            { x: '2015-04-05', y: 2.27 },
            { x: '2015-04-06', y: 2.28 },
            { x: '2015-04-07', y: 2.23 },
            { x: '2015-04-08', y: 2.25 },
            { x: '2015-04-09', y: 2.27 },
            { x: '2015-04-10', y: 2.28 },
            { x: '2015-04-11', y: 2.24 },
            { x: '2015-04-12', y: 2.27 },
            { x: '2015-04-13', y: 2.23 },
            { x: '2015-04-14', y: 2.26 },
            { x: '2015-04-15', y: 2.24 },
            { x: '2015-04-16', y: 2.28 },
            { x: '2015-04-17', y: 2.26 },
            { x: '2015-04-18', y: 2.23 },
            { x: '2015-04-19', y: 2.27 },
            { x: '2015-04-20', y: 2.24 },
            { x: '2015-04-21', y: 2.27 },
            { x: '2015-04-22', y: 2.26 },
            { x: '2015-04-23', y: 2.28 },
            { x: '2015-04-24', y: 2.25 },
            { x: '2015-04-25', y: 2.27 },
            { x: '2015-04-26', y: 2.28 },
            { x: '2015-04-27', y: 2.23 },
            { x: '2015-04-28', y: 2.25 },
            { x: '2015-04-29', y: 2.27 },
            { x: '2015-04-30', y: 2.28 }
        ],
        xkey: 'x',
        ykeys: ['y'],
        labels: ['平均'],
        lineColors: ['purple']
    });

    // 單體電壓 data
    var voltageData = [
        { x: '2015-04-01', y: 2.23 },
        { x: '2015-04-02', y: 2.24 },
        { x: '2015-04-03', y: 2.25 },
        { x: '2015-04-04', y: 2.26 },
        { x: '2015-04-05', y: 2.27 },
        { x: '2015-04-06', y: 2.28 },
        { x: '2015-04-07', y: 2.23 },
        { x: '2015-04-08', y: 2.25 },
        { x: '2015-04-09', y: 2.27 },
        { x: '2015-04-10', y: 2.28 },
        { x: '2015-04-11', y: 2.24 },
        { x: '2015-04-12', y: 2.27 },
        { x: '2015-04-13', y: 2.23 },
        { x: '2015-04-14', y: 2.26 },
        { x: '2015-04-15', y: 2.24 },
        { x: '2015-04-16', y: 2.28 },
        { x: '2015-04-17', y: 2.26 },
        { x: '2015-04-18', y: 2.23 },
        { x: '2015-04-19', y: 2.27 },
        { x: '2015-04-20', y: 2.24 },
        { x: '2015-04-21', y: 2.27 },
        { x: '2015-04-22', y: 2.26 },
        { x: '2015-04-23', y: 2.28 },
        { x: '2015-04-24', y: 2.25 },
        { x: '2015-04-25', y: 2.27 },
        { x: '2015-04-26', y: 2.28 },
        { x: '2015-04-27', y: 2.23 },
        { x: '2015-04-28', y: 2.25 },
        { x: '2015-04-29', y: 2.27 },
        { x: '2015-04-30', y: 2.28 }
    ];

    // 浮充電流 data
    var currentData = [
        { x: '2015-04-01', y: 0.1 },
        { x: '2015-04-02', y: 0.09 },
        { x: '2015-04-03', y: 0.08 },
        { x: '2015-04-04', y: 0.07 },
        { x: '2015-04-05', y: 0.1 },
        { x: '2015-04-06', y: 0.05 },
        { x: '2015-04-07', y: 0.07 },
        { x: '2015-04-08', y: 0.06 },
        { x: '2015-04-09', y: 0.09 },
        { x: '2015-04-10', y: 0.1 },
        { x: '2015-04-11', y: 0.06 },
        { x: '2015-04-12', y: 0.05 },
        { x: '2015-04-13', y: 0.08 },
        { x: '2015-04-14', y: 0.08 },
        { x: '2015-04-15', y: 0.1 },
        { x: '2015-04-16', y: 0.09 },
        { x: '2015-04-17', y: 0.07 },
        { x: '2015-04-18', y: 0.09 },
        { x: '2015-04-19', y: 0.1 },
        { x: '2015-04-20', y: 0.08 },
        { x: '2015-04-21', y: 0.09 },
        { x: '2015-04-22', y: 0.06 },
        { x: '2015-04-23', y: 0.05 },
        { x: '2015-04-24', y: 0.07 },
        { x: '2015-04-25', y: 0.06 },
        { x: '2015-04-26', y: 0.1 },
        { x: '2015-04-27', y: 0.1 },
        { x: '2015-04-28', y: 0.07 },
        { x: '2015-04-29', y: 0.09 },
        { x: '2015-04-30', y: 0.09 }
    ];

    // 單體電池內阻 data
    var resistanceData = [
        { x: '2015-04-01', y: 0.56 },
        { x: '2015-04-02', y: 0.69 },
        { x: '2015-04-03', y: 0.38 },
        { x: '2015-04-04', y: 0.47 },
        { x: '2015-04-05', y: 0.51 },
        { x: '2015-04-06', y: 0.65 },
        { x: '2015-04-07', y: 0.57 },
        { x: '2015-04-08', y: 0.46 },
        { x: '2015-04-09', y: 0.69 },
        { x: '2015-04-10', y: 0.41 },
        { x: '2015-04-11', y: 0.26 },
        { x: '2015-04-12', y: 0.35 },
        { x: '2015-04-13', y: 0.38 },
        { x: '2015-04-14', y: 0.28 },
        { x: '2015-04-15', y: 0.17 },
        { x: '2015-04-16', y: 0.19 },
        { x: '2015-04-17', y: 0.27 },
        { x: '2015-04-18', y: 0.39 },
        { x: '2015-04-19', y: 0.61 },
        { x: '2015-04-20', y: 0.68 },
        { x: '2015-04-21', y: 0.49 },
        { x: '2015-04-22', y: 0.56 },
        { x: '2015-04-23', y: 0.35 },
        { x: '2015-04-24', y: 0.27 },
        { x: '2015-04-25', y: 0.36 },
        { x: '2015-04-26', y: 0.51 },
        { x: '2015-04-27', y: 0.7 },
        { x: '2015-04-28', y: 0.7 },
        { x: '2015-04-29', y: 0.49 },
        { x: '2015-04-30', y: 0.39 }
    ];

    // 容量 data
    var capacityData = [
        { x: '2015-04-01', y: 75 },
        { x: '2015-04-02', y: 23 },
        { x: '2015-04-03', y: 45 },
        { x: '2015-04-04', y: 76 },
        { x: '2015-04-05', y: 100 },
        { x: '2015-04-06', y: 109 },
        { x: '2015-04-07', y: 87 },
        { x: '2015-04-08', y: 56 },
        { x: '2015-04-09', y: 39 },
        { x: '2015-04-10', y: 71 },
        { x: '2015-04-11', y: 96 },
        { x: '2015-04-12', y: 105 },
        { x: '2015-04-13', y: 48 },
        { x: '2015-04-14', y: 28 },
        { x: '2015-04-15', y: 61 },
        { x: '2015-04-16', y: 59 },
        { x: '2015-04-17', y: 70 },
        { x: '2015-04-18', y: 90 },
        { x: '2015-04-19', y: 111 },
        { x: '2015-04-20', y: 128 },
        { x: '2015-04-21', y: 69 },
        { x: '2015-04-22', y: 46 },
        { x: '2015-04-23', y: 35 },
        { x: '2015-04-24', y: 87 },
        { x: '2015-04-25', y: 76 },
        { x: '2015-04-26', y: 71 },
        { x: '2015-04-27', y: 61 },
        { x: '2015-04-28', y: 57 },
        { x: '2015-04-29', y: 49 },
        { x: '2015-04-30', y: 90 }
    ];

    // 放電電壓 data
    var dischargeData = [
        { x: '2015-04-01', y: 2.23 },
        { x: '2015-04-02', y: 2.13 },
        { x: '2015-04-03', y: 2.21 },
        { x: '2015-04-04', y: 1.8 },
        { x: '2015-04-05', y: 1.9 },
        { x: '2015-04-06', y: 2.2 },
        { x: '2015-04-07', y: 1.9 },
        { x: '2015-04-08', y: 1.9 },
        { x: '2015-04-09', y: 2.22 },
        { x: '2015-04-10', y: 2.13 },
        { x: '2015-04-11', y: 2.1 },
        { x: '2015-04-12', y: 2.21 },
        { x: '2015-04-13', y: 1.8 },
        { x: '2015-04-14', y: 2.23 },
        { x: '2015-04-15', y: 2.1 },
        { x: '2015-04-16', y: 2.21 },
        { x: '2015-04-17', y: 2.13 },
        { x: '2015-04-18', y: 2.2 },
        { x: '2015-04-19', y: 1.8 },
        { x: '2015-04-20', y: 2.22 },
        { x: '2015-04-21', y: 2.13 },
        { x: '2015-04-22', y: 2.23 },
        { x: '2015-04-23', y: 2.1 },
        { x: '2015-04-24', y: 2.21 },
        { x: '2015-04-25', y: 2.22 },
        { x: '2015-04-26', y: 2.2 },
        { x: '2015-04-27', y: 2.13 },
        { x: '2015-04-28', y: 2.23 },
        { x: '2015-04-29', y: 1.8 },
        { x: '2015-04-30', y: 2.21 }
    ];

    // 溫度 data
    var tempData = [
        { x: '2015-04-01', y: 31 },
        { x: '2015-04-02', y: 29 },
        { x: '2015-04-03', y: 28 },
        { x: '2015-04-04', y: 27 },
        { x: '2015-04-05', y: 31 },
        { x: '2015-04-06', y: 35 },
        { x: '2015-04-07', y: 27 },
        { x: '2015-04-08', y: 36 },
        { x: '2015-04-09', y: 29 },
        { x: '2015-04-10', y: 31 },
        { x: '2015-04-11', y: 30 },
        { x: '2015-04-12', y: 25 },
        { x: '2015-04-13', y: 28 },
        { x: '2015-04-14', y: 26 },
        { x: '2015-04-15', y: 25 },
        { x: '2015-04-16', y: 24 },
        { x: '2015-04-17', y: 37 },
        { x: '2015-04-18', y: 29 },
        { x: '2015-04-19', y: 31 },
        { x: '2015-04-20', y: 28 },
        { x: '2015-04-21', y: 29 },
        { x: '2015-04-22', y: 26 },
        { x: '2015-04-23', y: 25 },
        { x: '2015-04-24', y: 27 },
        { x: '2015-04-25', y: 26 },
        { x: '2015-04-26', y: 31 },
        { x: '2015-04-27', y: 31 },
        { x: '2015-04-28', y: 27 },
        { x: '2015-04-29', y: 29 },
        { x: '2015-04-30', y: 30 }
    ];

    // cell vertical progressbar
    function colorOfBar(percentage) {
        if (percentage <= 49) {
            return '#d4301d';
        } 
        else if (percentage >= 50 && percentage <= 79){
            return '#f6a509';
        } 
        else {
            return '#87AA2A';
        }
    }

    var initialPercentage = 100;
    var currentPercentage = initialPercentage;

    function randomProgress(){
        var percentage = String(currentPercentage);
        var decreseAmount = 1;
        $('#cell-progressbar').jQMeter({
            goal: '100',
            raised: percentage,
            barColor: colorOfBar(percentage),
            bgColor: '#E2E2E2',
            orientation: 'vertical',
            width: '100px',
            height: '200px',
            animationSpeed: 0,
            counterSpeed: 800
        });
        // if currentPercentage-decreseAmount is less than 0, start over from initialPercentage
        currentPercentage = ((percentage - decreseAmount) < 0) ? initialPercentage: percentage - decreseAmount;
    }

    // first run
    randomProgress();
    // decrese every 5 sec
    setInterval(randomProgress, 5000);
});
